package com.menna.nabatan_7asena.presentation.screens.quran.composables

fun formatJuzNumber(juz: Int): String {
    val names = listOf(
        "الأول","الثاني","الثالث","الرابع","الخامس",
        "السادس","السابع","الثامن","التاسع","العاشر",
        "الحادي عشر","الثاني عشر","الثالث عشر","الرابع عشر","الخامس عشر",
        "السادس عشر","السابع عشر","الثامن عشر","التاسع عشر","العشرون",
        "الحادي والعشرون","الثاني والعشرون","الثالث والعشرون",
        "الرابع والعشرون","الخامس والعشرون","السادس والعشرون",
        "السابع والعشرون","الثامن والعشرون","التاسع والعشرون","الثلاثون"
    )
    return names.getOrNull(juz - 1) ?: juz.toString()
}
